Repository: mozilla-l10n/mt-training-data
Catalog: hno/hno_pontoon.tmx
Source language: en_us
Languages: hno

source: If it’s your own words, just say <italicizedText>“Self Citation”</italicizedText>. We need to know where you found this content so that we can check it is in the public domain and no copyright restrictions apply. For more information about citation see our <guidelinesLink>Guidelines page</guidelinesLink>.
hno: اگر ایہ تسدے اپنڑے الفاظ ہن، تے صرف<italicizedText>“آپنڑاں حوالہ“</italicizedText>بولو۔ اساں کو اے جانڑناں ہے کہ تساں کو اے مواد کُتھو ملیا تاکہ اسیں اے چیک کر ہکاں ایہ عوامی ڈومین بچ ہے ہور کوئی کاپی رائٹ دی پابندیاں لاگو نیں۔ حوالہ دے متعلق مزید معلومات واسطے اسدا<guidelinesLink>رہنمائی دا صفحہ</guidelinesLink>دکھو</guidelinesLink>.

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
hno: اگر ریکاڈنگ ترٹ جلدی اے۔، یا دراڑاں پے جلدیاں ہن، تے اُس کو رد کر چھڑو جدو تک سارا ٹیکسٹ سنڑ نہ سکدے ہوؤ۔

source: If there is additional information you want to provide about this file, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
hno: اگر مزید معلومات ہے جڑی تُسیں اس فائل دے بارے دینڑا چہندے ہو، مہربانی رابطہ کرو<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If there is additional information you want to provide about this file that is not included in the template, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
hno: اگر مزید معلومات ہے جڑی تُسیں اس فائل دے بارے دینڑا چہندے ہو، او ٹیمپلیٹ بچ بھی شامل نیں، مہربانی رابطہ کرو<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If the sentence does not meet the above criteria, click the "No" button.
hno: اگر جملے اُتلے میعار تے پورے نیں اُتردے تے ’’ناں‘‘ آلہ بٹن کلک کرو۔

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
hno: اگر جملہ اُتا دِتے دے میعار تے پورا نیں اُتردا، تے بائیں پاسے&quot;مسترد&quot;دا بٹن دباؤ۔ اگر تُساں کو جملے دے بارے شک ہوے، تسیں اسکو چُھوڑ ہکدے ہو تے اگلے کسی تے جُل ہکدے ہو۔

source: If the sentence is offensive or upsetting - for example because of explicit content, or another violation of our <communityGuidelines>community participation guidelines</communityGuidelines> - you should reject the sentence. You can also reach out to us at <emailFragment>commonvoice@mozilla.com</emailFragment> to escalate the issue.
hno: اگر جملہ جارحانہ یا پریشان کرنا آلا ہِے - مثال دے طور تے واضح مواد دی وجہ تو، یا اسدی <communityGuidelines>کمیونٹی شرکت دیاں ہدایتاں</communityGuidelines> دی خلاف ورزی - تساں کو اس جملے کو مسترد کر دینڑا چاہِیدا ہِے۔ تُسیں مسئلے کو بڑانڑاں واسطے <emailFragment>commonvoice@mozilla.com</emailFragment> تے وی اسدے نال رابطہ کر سکدے ہو۔

source: If the sentence meets the criteria above, click the "Yes" button.
hno: اگر جملے اُتلے میعار تے پورے ہن تے ’’ہاں‘‘ بٹن کلک کرو۔

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
hno: اگر جملہ میعار تہ پورا اُترے، تے سجّے پاسے&quot;منظور&quot;دا بٹن دباؤ۔

source: If you are unsure about the sentence, you may also skip it and move on to the next one.
hno: اگر تساں کو جملے دے بارے یقین کوئی نیں، تسیں اس کو چھوڑ ہکدے ہو تے اگلے جملے تے جُل سکدے ہو۔

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
hno: اگر تساں کو کوئی ہجی چیز ملدی ہے جس دا احاطہ اے ہدایات نیں کردیاں، تے براہ مہربانی فِر اپنڑے بہترین فیصلے دے مطابق وٹ دیو۔ اگر تسیں واقعی فیصلہ نہ کر ہکدے او، سکپ بٹن استعمال کرو تے اگلی ریکارڈنگ تے چلے جلو۔

source: If you could <strong>hear them</strong> and <strong>understand them</strong>, it’s usually <strong>best to approve</strong>.
hno: جے تسیں <strong>انہاں کو سنڑ </strong>ہور <strong>سمجھ</strong>سکدے ہو، تے عام طور<strong>تصدیق دینڑی اچھی ہے</strong>۔

source: If you don’t hear from us within a couple of days, reach out at <emailLink>{ $email }</emailLink> and we’ll get back to you!
hno: اگر تساں کو دو چار دنوں بچو اساں کولو جواب نہ آوا، <emailLink>{ $email }</emailLink>تے رابطہ کرو تے اسیں تساں کو واپس جواب دیساں!

source: If you don't see your language in either part of the platform, select both.
hno: دونڑیاں دا انتخاب کرو جے اگر تساں کو کسی بھی پلیٹ فارم بچ اپنڑی زبان نہ دِکھّا۔

source: If you or your organisation would like to contribute back to the project, you can make a <donateLink>donation</donateLink> or reach out to our partnerships team on <emailFragment>commonvoice@mozilla.com</emailFragment>.
hno: اگر تسیں یا تسدی تنظیم منصوبے بچ دوبارہ شرکت کرنا چہندے ہن، تے تسیں ہک<donateLink>عطیہ</donateLink>کر ہکدے ہو یا اسدی شراکت دار ٹیم نال رابطہ کر ہکدے، تے<emailFragment>۔commonvoice@mozilla.com</emailFragment>

source: If you’re having trouble contributing, you can switch back to seeing all content for your language at any time.
hno: اگر تساں کو حصہ بینڑا بچ مشکل اے تے تسیں کسی بی ویلے آپنڑی زبان دا سارا مواد دیکھنڑے تے واپس سوئچ کر سکدے او۔

source: If you’re looking for tools to build ASR models, you can connect to other people in the community <discourseLink>on Discourse</discourseLink>.
hno: اگر تسیں ASR ماڈلز بنڑانڑاں واسطے ٹولز دی تلاش بچ ہو، تے تسیں کمیونٹی بچ دویاں لوگاں نال رابطہ کر سکدے او<discourseLink>بات چیت تے</discourseLink>۔

source: If you're looking to speak more about the dataset, want to co-invest in planned platform expansions or look for collaboration opportunities, <emailFragment>drop us a line.</emailFragment>
hno: اگر تسیں ڈیٹا سیٹ دے بارے مزید گَل کرنا چہندے ہو، منصوبہ بند پلیٹ فارم دی توسیع بچ مشترکہ سرمایہ کاری کرنا چہندے ہو یا تعاون دے موقعے حاصل کرنا چہندے ہو، تے <emailFragment> اساںکو ہک لائن لکھ چُھڑو۔ </emailFragment>

source: If you run out of sentences to review, please help us collect more sentences!
hno: اگر تُساں کول جائزہ گِِننّا واسطے جملے مُک جُلدے ہن، براہ مہربانی ہور جملے جمع کرنا واسطے اسدی مدد کرو!

source: If you think the pronunciation makes it <strong>impossible to understand</strong>, or there’s a <strong>lot of background noise</strong>, or there are <strong>other people speaking too</strong>, then you should reject the clip. <accuracyLink>See more information in our accuracy criteria</accuracyLink>.
hno: اگر تساں کو لگدا ہے کہ تلفظ اُناں کو<strong>سمجنڑا نا ممکن</strong>بڑیندا ہے، یا اُتھا<strong>پس منظر بچ مچ شور ہے</strong>، یا اُتھا<strong>دؤئے لوگ بھی بولدے ہن</strong>، فر تساں کو اُو کلپ رد کر چُھڑنا چاہے دا ہے۔ <accuracyLink>اسدے درستگی دے میعار بچ مزید معلومات دکھو</accuracyLink>۔

source: Igbo
hno: اگبو

source: I just created a personal goal for voice donation to #CommonVoice -- join me and help teach machines how real people speak { $link }
hno: میں #CommonVoice کو آواز عطیہ کرنا آستے ذاتی ہدف بنڑایا ہے -- مڑا ساتھ دیو ہور مشیناں کو سکھاؤ کہ اصلی لوگ کسطرح بولدے ہن { $link }

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
hno: جسطرح تُسیں موزیلا دی<privacyLink>رازداری دی پالیسی</privacyLink> وچ معلومات کو سنبھالنڑا دی وضاحت کردے ہو میں اس بارے تُساں نال متفق آں۔

source: Include appropriate citation
hno: مناسب حوالہ شامل کرو

source: Includes email, username & demographic info, available right away
hno: ای میل، یوزر نیم تے آبادیاتی معلومات تے مشتمل ہے، ہنڑ دستیاب ہے

source: Includes mp3s and related sentences, may take some time to prepare
hno: mp3s ہور متعلقہ جملے شامل ہن، تیار ہونڑا واسطے کجھ وقت لگ ہکدا ہے

source: Indonesian
hno: انڈونیشی

source: Indus Kohistani
hno: انڈس کوہستانی

source: Information about the language
hno: زبان دے بارے معلومات

source: In Progress
hno: ہو رہیا ہے

source: Interested in getting involved with this project, or partnering with us?
hno: اس منصوبے بچ شامل ہونڑا بچ دلچسپی ہے یا اساں نال شریک ہونڑا دی؟

source: Interested in learning more and contributing to the project?
hno: تسدی ہور سکھنڑاں تے منصوبے بچ حصہ بینڑا بچ دلچسپی ہے؟

source: Interface language:
hno: انٹرفیس زبان:

source: Interlingua
hno: انٹرلنگوا

source: Interlingue
hno: انٹرلنگوا

source: [interrupted by background noise]
hno: [پچھا دے شور سنڑ رکاوٹ بائی]

source: Intersex
hno: انٹرسیکس

source: Iñupiaq
hno: انوپیاق

source: Invalid file
hno: غلط فائل

source: Irish
hno: آئرش

source: IsiNdebele (North)
hno: اندبیلی (شمالی)

source: IsiNdebele (South)
hno: اندبیلی (جنوبی)

source: <isoCodeLink>ISO Codes</isoCodeLink> if known
hno: <isoCodeLink>ISO کوڈ</isoCodeLink>اگر پتہ ہن

source: Is the clip valid?
hno: اے کلپ صیح ہے؟

source: Italian
hno: اطالوی

source: It contains words or phrases that are hard to read or pronounce.
hno: اس بچ او الفاظ یا جملے ہن جڑے پڑھنا ہور بولنا بچ مشکل ہن۔

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do?
hno: ڈیٹا سیٹس دی میزبانی کرنا اَستے ہور اس پلیٹ فارم کو 100 تو زیادہ زبان دی کمیونیٹیاں جڑیاں استے اُتا بھروسہ کردیاں ہن واسطے اچھا بنڑانڑا واسطے تقریباََ ہک ملین ڈالر سالانہ خرچ آندا ہے۔

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. <strong>If you value open, inclusive data - donate today!</strong>
hno: ڈیٹا سیٹس دی میزبانی کرنا اَستے ہور اس پلیٹ فارم کو 100 تو زیادہ زبان دی کمیونیٹیاں جڑیاں استے اُتا بھروسہ کردیاں ہن واسطے اچھا بنڑانڑ واسطے تقریباََ ہک ملین ڈالر سالانہ خرچ آندا ہے۔ <strong>اگر تُسین اوپن، جامع ڈیٹا دی قدر کردے ہو تے- اَج ہی عطیہ کرو!</strong>

source: It costs a lot of money to continually host and release the datasets, improve the platform and run <africaMradiLink>community programmes</africaMradiLink>.
hno: ڈیٹا سیٹس دی مسلسل میزبانی ہور ریلیز کرنا تے، پلیٹ فارم کو بہتر کرنا ہور <africaMradiLink>کمیونٹی پروگرامز</africaMradiLink> چلانڑا تے بہت سارے اخراجات ایندے ہن۔

source: It is very important that all text sentences are <publicDomain>public domain</publicDomain> (cc0) as the Common Voice dataset is released under a cc0 license. Only ever upload a sentence if you are sure, and always include the relevant citation.
hno: اے بہت اہم ہے کہ سارے متن آلے جملے<publicDomain>عوامی ڈومین</publicDomain> (cc0) دے ہون کیّاں کہ کامن وائس ڈیٹاسیٹ کو cc0 لائسنس دے تحت جاری کیتا دا ہے۔ صرف اُوہی جملہ اپلوڈ کرو جس دے بارے تُساں یقین ہوا، ہور ہمیشہ متعلقہ حوالہ شامل کرو۔

source: It is written in a language different than what I’m reviewing.
hno: اے مڑی نظرثانی آلی زبان کولو مختلف زبان بچ لکھے دے ہن۔

source: It is written in a language different than what I’m speaking.
hno: جڑی میں بولدا ہاں اے اس کولو مختلف زبان بچ لکھیا دا ہے۔

source: It’s important to include citations so we can check that sentences are in the public domain and no copyright restriction apply.
hno: حوالے دینڑے ضروری ہن تاکہ اسیں اے دِکھ ہکاں کہ جملے عوامی ڈومین بچ ہن تے کاپی رائٹ دی پابندیاں لاگو نیں ہوندیاں۔

source: It takes a lot to make Common Voice happen! We don't do it alone. Want to partner with us? We'd love to hear from you.
hno: کامن وائس بڑینڑا واسطے مُچ کجھ لگدا! اسیں اے کم کلہے نہ کردے۔ اساں نال حصہ داری کرنا چہندے ہو؟ اساں تساں کولو اے سنڑنا ہچھا لگدا ہے۔

source: Izhorian
hno: ایزورین

source: Japanese
hno: جاپانی

source: Jaqaru
hno: جقارو

source: Javanese
hno: جاوانیس

source: Join Discord Community
hno: ڈسکارڈ کمیونٹی نال جُڑّو

source: Join the Common Voice mailing list
hno: کامن وائس دی ای میل والی لسٹ نال جڑو

source: Join us on Discord
hno: ڈسکارڈ تے اساں نال جّڑّو

source: Just respond to the prompt as naturally as you can in a couple of sentences. Make sure your language is respectful and inoffensive.
hno: پرومٹس کو جتنا ہو سکا صرف قدرتی طور تے ہک دو جملیاں بچ جواب دیو۔ اے یقینی بنڑاؤ کہ تسدی زبان تہذیب آلی تے بے ضرر ہوّے۔

source: Just Unsure?
hno: صرف غیر یقینی؟

source: Kabardian
hno: کبردیان

source: Kabyle
hno: کبائل

source: Kalasha
hno: کیلاشا

source: Kalenjin
hno: کلینجن

source: Kalkoti
hno: کالکوٹی

source: Kannada
hno: کناڈا

source: Kaqchikel
hno: کاکچیل

source: Kara
hno: کارا

source: Karakalpak
hno: کراکلپاک

source: Kateviri
hno: کیٹویری

source: Kazakh
hno: کزاک

source: { $kb }kb max
hno: { $kb }kb زیادہ تو زیادہ

source: Keep
hno: رکھو

source: Keep it up, record again <recordIcon></recordIcon>
hno: کوشش کردے رُو، دبارہ رکارڈ کرو <recordIcon></recordIcon>

source: Keep the recordings
hno: ریکاڈنگ رکھو

source: Keep track of your progress and metrics across multiple languages.
hno: مختلف زباناں بچ آپنڑی پیش رفت تے پیمائش دا حساب رکھو۔

source: Keep track of your progress with a profile
hno: پروفائل دے زریعے اپنڑی پیش رفت تے نظر رکھو

source: Keep track of your progress with a profile and help our voice data be more accurate.
hno: پروفائل نال آپنڑی پیشرفت دا حساب رکھو تے اسدے آواز دے ڈیٹا دی مزید درستگی آستے مدد کرو۔

source: Kelabit
hno: کلابٹ

source: Kenyah
hno: کینیا

source: Kenyi
hno: کینٸی

source: Ketrani
hno: کھیترانی

source: Khmer
hno: خمِر

source: Khowar
hno: کُھوار

source: K'iche'
hno: کیچہ

source: Kichwa
hno: کیچوا

source: Kidaw'ida
hno: کڈاوئدا

source: Kikuyu
hno: کی کویو

source: Kinyarwanda
hno: کنیا روانڈا

source: Kohistani Shina
hno: کوہستانی شینا

source: Kom
hno: کوم

source: Komi-Zyrian
hno: کومی زائرین

source: Konkani (Devanagari)
hno: کونکانی (دیوناگری)

source: Korean
hno: کورین

source: Kuku
hno: کوکو

source: Kurmanji Kurdish
hno: کامونجی کُردش

source: Kyrgyz
hno: کرغز

source: Language
hno: زبان

source: Language Fundamentals (e.g. Digits, Letters, Money)
hno: زبان دے بنیادی اصول (مثلاً ہندسے، حروف، رقم)

source: Language Request
hno: زبان دی درخواست

source: Language request successfully submitted, thank you.
hno: زبان دی درخواست کامیابی نال جمع ہو گئی، تسدی مہربانی

source: Languages
hno: زباناں

source: Languages can have their own validation rules with additional requirements when they localize. If there is no specific validation file for a language, the English rules will show for contributors.
hno: زباناں مقامی ہونڑاں تو مزید تقاضیاں دے نال اناں دے آپنڑے توثیق دے اصول ہو سکدے ہِن۔ اگر کسی زبان واسطے مخصوص توثیق دی فائل نیں، تے انگریزی دے قاعدے شراکت داراں واسطے ظاہر ہوسن۔

source: Language Text
hno: زبان دی عبارت

source: Lao
hno: لاؤ

source: Large bulk sentence submission
hno: بڑی کھیپ جملیاں دی جمع کرنا

source: Large scale corporates and platform companies
hno: بڑے پیمانے تے کارپوریٹ تے پلیٹ فارم کمپنیاں

source: Lassi
hno: لاسی

source: Last Updated: { $lastUpdatedTimeStamp }
hno: آخری اپ ڈیٹ: { $lastUpdatedTimeStamp }

source: Latgalian
hno: لٹگالین

source: Latvian
hno: لاٹیوی

source: Launched
hno: لانچ ہو گئی

source: Laz
hno: لاز

source: Leaderboard Visibility
hno: لیڈربورڈ دی نمائش

source: Learn about partnerships with Common Voice
hno: کامن وائس نال شراکتاں بارے جانڑو

source: Learn how to check a transcription
hno: اے سکھو کہ کسطرح ہک ٹرانسکرپشن دا جائزہ گَھنّا اے

source: Learn how to take part
hno: سکھو کسطرح حصہ گِِندے ہن

source: Learn how to transcribe
hno: سکھو کسطرح ٹرانسکرائب کردے نے

source: Learn how to use this page
hno: سِکھو اے صفحہ کسطرح استعمال کرنا اے

source: Learn More
hno: مزید سکھو

source: Leaving now means you’ll lose your changes
hno: ہونڑ چھوڑنا دا مطلب ہے کہ تسدی ترمیم نہ رہسی

source: Leaving now means you'll lose your progress
hno: ہونڑ چھوڑنا دا مطلب ہے کہ تسدی پیش رفت مُک جُلسی

source: Length
hno: لمبائی

source: Let's Get Started
hno: آؤ شروع کراں

source: Letters must be valid in the language being spoken. For example, “ж” is a letter in the Russian alphabet but is never used in English and so should never appear in any English source text.
hno: جڑی زبان بول رے ہو اس بچ حروف درست ہونڑے چاہیدے ہن۔ مثال دے طور تے، “ж” ہک روسی حروف تہنی بچ ہک لفظ ہے لیکن انگریزی بچ اے کدے استعمال نیں ہویا تے اے کسی انگریزی سورس ٹیکسٹ بچ ظاہر نیں ہونڑا چاہیدا۔

source: LibriSpeech is a corpus of approximately 1000 hours of 16Khz read English speech derived from read audiobooks from the LibriVox project.
hno: لائبرسپیچ تقریبََا 1000 گھنٹیاں دا 16Khz ریڈ انگلش سپیچ تے مشتمل ہک کارپس ہے جڑا لائبری ووکس پراجیکٹ دی ریڈ آڈیو بکس تو حاصل کیتا گیا۔

source: License
hno: لائسنس

source: License: <licenseLink>CC-0</licenseLink>
hno: لائسنس: <licenseLink>CC-0</licenseLink>

source: License: <licenseLink>{ $license }</licenseLink>
hno: لسانس:<licenseLink>{ $license }</licenseLink>

source: Ligurian
hno: لیگورین

source: Lingala
hno: لنگالی

source: Link Copied
hno: لنک دی کاپی ہو گئی

source: Links to websites that can help us understand the language
hno: ویب سائٹاں دے لنک جڑّے اساں کو زبان سمجھنے بچ مدد کر ہکدے ہن۔

source: Listen
hno: سنڑو

source: Listening
hno: سنڑناں

source: Listen options menu
hno: اختیارات آلے مینو کو سنڑو

source: Listen-Queue
hno: سنڑنادی-لینڑ

source: Lithuanian
hno: لیتھونین

source: Loading…
hno: لوڈ ہو رہیا ہے۔۔۔۔

source: Loading sentences…
hno: جملے لوڈ ہورے ہن۔۔۔

source: Localized
hno: مقامی ہوئے دے

source: Log In
hno: لاگ ان

source: Login Identity
hno: لاگ ان شناخت

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
hno: <loginLink>لاگ اِن</loginLink>یا<loginLink>سائن اپ</loginLink>مختلف قسم دے جملے بینڑا واسطے

source: Log in or sign up to get started
hno: شروع کرنا واسطے لاگ ان یا سائن اپ کرو

source: Log In / Sign Up
hno: لاگ ان/ سائن اپ

source: Log In / Sign Up with { $company } email
hno: { $company } ای میل نال لاگ ان/ سائن اپ

source: Log Out
hno: لاگ آوٹ

source: Lojban
hno: لوجبن

source: Look for text where the copyright no longer applies - for example most books that were published before 1920
hno: اے جا مواد ڈھونڈو جتھا کاپی رائٹ لاگو نہ ہون-مثال دے طور تے زیادہ تر کتاباں جڑیاں 1920 تو پہلے چَھپّیاں ہن۔

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
hno: اے لگدا ہے اس زبان بچ سنڑا آستے ہور کوئی کلپ نیں۔ ہونڑ کوئی نئی ریکاڈنگ کر کے قطار بھرنا بچ اسدی مدد کرو۔

source: Luganda
hno: لوگانڈا

source: Luxembourgish
hno: لگژمبرگش

source: Macedonian
hno: مقدونی

source: Mada
hno: ماڈا

source: Maithili
hno: مائتھیلی

source: Make sure the platform is recording before you start speaking, and that it only stops once you’re finished.
hno: اس گلا کو یقینی بنڑاؤ کہ تسدے بولنا شروع کرنا کولو پہلے پلیٹ فارم ریکارڈ کر رہیا ہے، ہور اے کہ اے تسدے ختم ’کرنا تے رُکے۔

source: Make sure the sentence meets the following criteria:
hno: اس گلا کو یقینی بنڑاؤ کہ جملہ دتے دے میعار تہ پورا اُترا:

source: Make sure they can be answered in just a couple of sentences
hno: اس گلا کو یقینی بنڑاؤ کہ ان دا جواب تھوڑے جے جملیاں وچ ہوّا

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
hno: کجھ گمنام آبادیاتی ڈیٹا دیندے ہویاں آپنڑے جمع کرالے دے ڈیٹا کو جتنا ہو سکا ہچھا بنڑاؤ۔ اسیں سارے آبادیاتی ڈیٹا دی شناخت چھپیندے آں، عوامی بڑانڑا تو پہلے۔

source: Malagasy
hno: مالاگاسی

source: Malay
hno: مالی

source: Malayalam
hno: ملیالم

source: Male/Masculine
hno: مرد/مذکر

source: Maltese
hno: مالٹی

source: Manage Email Subscriptions
hno: ای میل سبسکرپشناں منیج کرو

source: Manage Subscriptions
hno: سبسکرپشناں منیج کرو

source: Manx
hno: مینکس

source: Mapudungun
hno: ماپودونگی

source: Marathi
hno: میراٹھی

source: <mark>Check</mark>
hno: <mark>چیک کرو</mark>

source: <mark>Data</mark>
hno: <mark>مواد/معلومات</mark>

source: <mark>Prompt</mark>
hno: <mark>پرامپٹ </mark>

source: <mark>Respond</mark>
hno: <mark>جواب</mark>

source: <mark>Transcribe</mark>
hno: <mark>ٹرانسکرائب</mark>

source: <mark>Using CV for</mark><br/><mark>your research?</mark>
hno: <mark>سی وی استعمال کر رے ہاں</mark><br/><mark>تُڑی تحقیق واسطے؟</mark>

source: <mark>We need</mark><br/><mark>your help!</mark>
hno: <mark>اساں کو</mark><br/><mark>تسدی مدد چائی دی ہے!</mark>

source: Matrix is an open, lightweight protocol for decentralized, real-time communication, and Mozilla's preferred open discussion platform.
hno: میٹرکس ہک کھلا تے ہلکا جا ڈیسنڑلائزڈ، رئیل ٹائم گفتگو دا طریقہ کار اے، ہور موزیلا دا پسندیدہ کل کے گل بات کرنا دا پلیٹ فارم اے۔

source: Maximum file size: 25 MB
hno: فائل دا کم تو کم سائز:25 MB

source: Maybe our <homepageLink>homepage</homepageLink> will help? To ask a question, please join the <matrixLink>Matrix community chat</matrixLink>, monitor site issues via <githubLink>GitHub</githubLink> or visit <discourseLink>our Discourse forums</discourseLink>.
hno: ہو سکدا ہے اسدا<homepageLink>ہوم بیچ</homepageLink>مدد کرے؟ سوال پچھنڑا آستے، براہ مہربانی<matrixLink>میٹرکس کمیونٹی چیٹ</matrixLink>بچ شامل ہوؤ، <githubLink> GitHub </githubLink>دے ذریعے سائٹ دیاں مَسلیاں دی نگرانی کرو یا <discourseLink>اسدا ڈسکورس فورمز</discourseLink> تے جُلو۔

source: MB
hno: ایم بی

source: Mbo
hno: مبو

source: Meadow Mari
hno: میڈوو ماری

source: Media and Entertainment
hno: میڈیا تے تفریح

source: Medumba
hno: میڈمبا

source: Meetei Lon
hno: میٹی لون

source: Message
hno: سنیہا

source: Michoacán Mazahua
hno: مچاوکن مزاہاو

source: Mingrelian
hno: منگریلین

source: Minimum sentences in file: 1000
hno: فائل بچ کم تو کم جملے:1000

source: [Mismatched content]
hno: [غیر مماثل مواد]

source: Misreadings
hno: غلط پڑھنا

source: Missing an 's' at the end of a word.
hno: لفظ دے آخر تے ہک 's' غائب ہے۔

source: Missing an <strong>'s'</strong> at the end of a word.
hno: لفظ دے آخر تے ہک <strong>'s'</strong>غائب ہے۔

source: Missing 'A' or 'The' at the beginning of the recording.
hno: ریکاڈنگ دے شروع تے 'A' یا 'The' غائب ہے۔

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
hno: ریکاڈنگ دے شروع بچ کوئی لفظ غائب ہن مثلاََ <strong>'A'</strong> یا <strong>'The'</strong>۔

source: Missing the end of the last word by cutting off the recording too quickly.
hno: ریکاڈنگ کو مچ جلدی کٹ کے آخری لفظ دا سرا غائب کرنا۔

source: Mixed
hno: مکس کیتادا

source: Mixteco Yucuhiti
hno: مکسٹیکو یوکیوہٹی

source: Mokpwe
hno: موکپوے

source: Moksha
hno: موکشا

source: Mongolian
hno: منگولی

source: More
hno: مزید

source: [More has been recorded than the required text]
hno: [مطلوبہ عبارت کولو زیاداہ ریکارڈ کر چھڑیا دا ہے]

source: More languages coming soon
hno: ہور زباناں جلدی آ ریاں

source: Mossi
hno: موسی

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
hno: بڑیاں کمپنیاں دے استعمال بچ زیادہ تر ڈیٹا لوگاں دی اکثریت کو دستیاب نیں ہوندا۔ اسیں سوچدے ہاں کہ اے جدت کو دبیندا ہے۔ اسی کیتے اسں کامن وائس شروع کیتا، کھلا تے ہر اک کو دستیاب ہوے ہک آواز ریکگنیشن دی مدد آلہ منصوبہ۔

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
hno: بڑیاں کمپنیاں دے استعمال بچ زیادہ تر ڈیٹا لوگاں دی اکثریت کو دستیاب نیں ہوندا۔ اسیں سوچدے ہاں کہ اے جدت کو دبیندا ہے۔ اسی کیتے کامن وائس دا منصوبہ شروع کیتا، آواز ریکگنیشن دی مدد آلہ منصوبہ جیڑا ہر اک کو دستیاب ہوے۔

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
hno: لوگاں دیاں زیادہ تر ریکارڈنگ انہاں دی قدرتی آواز بچ گلاں دیاں ہوندیاں ہن۔ تسیں کدی کدار غیرمیعاری ریکارڈنگ کو قبول کر سگدے ہو جڑی چیخنا، گوشا کرنا، یا ظاہری طورتے ‘ڈرامے’ دی آواز بچ ہے۔ براہ مہربانی گائی دی ریکاڈنگاں ہور جڑیاں کمپیوٹر دے استعمال نال ترتیب دتیا ہون کو رد کرو۔

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
hno: موزیلا کامن وائس ہک قدم ہے، مشیناں کو سکھینڑا واسطے کہ اصلی لوگ کسطرح بولدے ہن۔
